{
  "date": "2025-11-15",
  "items": [
    {
      "title": "North Korean Hackers Turn JSON Services into Covert Malware Delivery Channels",
      "link": "https://thehackernews.com/2025/11/north-korean-hackers-turn-json-services.html",
      "summary": "The North Korean threat actors behind the Contagious Interview  campaign have once again tweaked their tactics by using JSON storage services to stage malicious payloads.  \"The threat actors have recently resorted to utilizing JSON storage services like JSON Keeper, JSONsilo, and npoint.io to host and deliver malware from trojanized code projects, with the lure,\" NVISO researchers Bart Parys, Stef Collart, and Efstratios Lontzetidis said  in a Thursday report.  The campaign essentially involves approaching prospective targets on professional networking sites like LinkedIn, either under the pretext of conducting a job assessment or collaborating on a project, as part of which they are instructed to download a demo project hosted on platforms like GitHub, GitLab, or Bitbucket.  In one such project spotted by NVISO, it has been found that a file named \"server/config/.config.env\" contains a Base64-encoded value that masquerades as an API key, but, in reality, is a URL ...",
      "tags": [
        "malware",
        "attack"
      ],
      "urgency": "Low",
      "slug": "north-korean-hackers-turn-json-services-into-cover",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Researchers Find Serious AI Bugs Exposing Meta, Nvidia, and Microsoft Inference Frameworks",
      "link": "https://thehackernews.com/2025/11/researchers-find-serious-ai-bugs.html",
      "summary": "Cybersecurity researchers have uncovered critical remote code execution vulnerabilities impacting major artificial intelligence (AI) inference engines, including those from Meta, Nvidia, Microsoft, and open-source PyTorch projects such as vLLM and SGLang.  \"These vulnerabilities all traced back to the same root cause: the overlooked unsafe use of ZeroMQ (ZMQ) and Python's pickle deserialization,\" Oligo Security researcher Avi Lumelsky said  in a report published Thursday.  At its core, the issue stems from what has been described as a pattern called ShadowMQ , in which the insecure deserialization logic has propagated to several projects as a result of code reuse.  The root cause is a vulnerability in Meta's Llama large language model (LLM) framework ( CVE-2024-50050 , CVSS score: 6.3/9.3) that was patched by the company last October. Specifically, it involved the use of ZeroMQ's recv_pyobj() method to deserialize incoming data using Python's pickle module.  ...",
      "tags": [
        "vulnerability",
        "critical"
      ],
      "urgency": "High",
      "slug": "researchers-find-serious-ai-bugs-exposing-meta-nvi",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Iranian Hackers Launch 'SpearSpecter' Spy Operation on Defense & Government Targets",
      "link": "https://thehackernews.com/2025/11/iranian-hackers-launch-spearspecter-spy.html",
      "summary": "The Iranian state-sponsored threat actor known as APT42  has been observed targeting individuals and organizations that are of interest to the Islamic Revolutionary Guard Corps (IRGC) as part of a new espionage-focused campaign.  The activity, detected in early September 2025 and assessed to be ongoing, has been codenamed  SpearSpecter  by the Israel National Digital Agency (INDA).  \"The campaign has systematically targeted high-value senior defense and government officials using personalized social engineering tactics,\" INDA researchers Shimi Cohen, Adi Pick, Idan Beit-Yosef, Hila David, and Yaniv Goldman said. \"These include inviting targets to prestigious conferences or arranging significant meetings.\"  What's notable about the effort is that it also extends to the targets' family members, creating a broader attack surface that exerts more pressure on the primary targets.  APT42 was first publicly documented in late 2022 by Google Mandiant, detailing its...",
      "tags": [
        "phishing",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "iranian-hackers-launch-spearspecter-spy-operation-",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Ransomware's Fragmentation Reaches a Breaking Point While LockBit Returns",
      "link": "https://thehackernews.com/2025/11/ransomwares-fragmentation-reaches.html",
      "summary": "Key Takeaways:   85 active ransomware and extortion groups  observed in Q3 2025, reflecting the most decentralized ransomware ecosystem to date.  1,590 victims disclosed  across 85 leak sites, showing high, sustained activity despite law-enforcement pressure.  14 new ransomware brands  launched this quarter, proving how quickly affiliates reconstitute after takedowns.  LockBit's reappearance with version 5.0  signals potential re-centralization after months of fragmentation.   In Q3 2025, Check Point Research recorded a record 85 active ransomware and extortion groups , the highest ever observed. What was once a concentrated market dominated by a few ransomware-as-a-service (RaaS) giants has splintered into dozens of smaller, short-lived operations.  This proliferation of leak sites represents a fundamental structural shift. The same enforcement and market pressures that disrupted large RaaS groups have fueled a wave of opportunistic, decentralized actors, many run by former affiliat...",
      "tags": [
        "ransomware",
        "breach"
      ],
      "urgency": "Medium",
      "slug": "ransomwares-fragmentation-reaches-a-breaking-point",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Chinese Hackers Use Anthropic's AI to Launch Automated Cyber Espionage Campaign",
      "link": "https://thehackernews.com/2025/11/chinese-hackers-use-anthropics-ai-to.html",
      "summary": "State-sponsored threat actors from China used artificial intelligence (AI) technology developed by Anthropic to orchestrate automated cyber attacks as part of a \"highly sophisticated espionage campaign\" in mid-September 2025.  \"The attackers used AI's 'agentic' capabilities to an unprecedented degree – using AI not just as an advisor, but to execute the cyber attacks themselves,\" the AI upstart said .  The activity is assessed to have manipulated Claude Code, Anthropic's AI coding tool, to attempt to break into about 30 global targets spanning large tech companies, financial institutions, chemical manufacturing companies, and government agencies. A subset of these intrusions succeeded. Anthropic has since banned the relevant accounts and enforced defensive mechanisms to flag such attacks.  The campaign, GTG-1002, marks the first time a threat actor has leveraged AI to conduct a \"large-scale cyber attack\" without major human intervention an...",
      "tags": [
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "chinese-hackers-use-anthropics-ai-to-launch-automa",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Now-Patched Fortinet FortiWeb Flaw Exploited in Attacks to Create Admin Accounts",
      "link": "https://thehackernews.com/2025/11/fortinet-fortiweb-flaw-actively.html",
      "summary": "Cybersecurity researchers are sounding the alert about an authentication bypass vulnerability in Fortinet Fortiweb Web Application Firewall (WAF) that could allow an attacker to take over admin accounts and completely compromise a device.  \"The watchTowr team is seeing active, indiscriminate in-the-wild exploitation of what appears to be a silently patched vulnerability in Fortinet's FortiWeb product,\" Benjamin Harris, watchTowr CEO and founder, said in a statement.  \"Patched in version 8.0.2 , the vulnerability allows attackers to perform actions as a privileged user - with in-the-wild exploitation focusing on adding a new administrator account as a basic persistence mechanism for the attackers.\"   The cybersecurity company said it was able to successfully reproduce the vulnerability  and create a working proof-of-concept (Poc). It has also released  an artifact generator tool for the authentication bypass to help identify susceptible devices.   According to d...",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "now-patched-fortinet-fortiweb-flaw-exploited-in-at",
      "source": "The Hacker News",
      "date": "2025-11-15"
    },
    {
      "title": "Fortinet Confirms Active Exploitation of Critical FortiWeb Vulnerability",
      "link": "https://www.securityweek.com/fortinet-confirms-active-exploitation-of-critical-fortiweb-vulnerability/",
      "summary": "Security firms say the flaw has been actively exploited for weeks, even as Fortinet quietly shipped fixes and CISA added the bug to its KEV catalog.",
      "tags": [
        "vulnerability",
        "critical"
      ],
      "urgency": "High",
      "slug": "fortinet-confirms-active-exploitation-of-critical-",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "CYBERCOM 2.0: Pentagon Unveils Plan to Fix Cyber Talent Shortfalls",
      "link": "https://www.securityweek.com/cybercom-2-0-pentagon-unveils-plan-to-fix-cyber-talent-shortfalls/",
      "summary": "The goal is to produce a cyber force capable of defeating threats posed by major adversaries such as China.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "cybercom-20-pentagon-unveils-plan-to-fix-cyber-tal",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "Watch on Demand: CISO Forum 2025 Virtual Summit",
      "link": "https://www.securityweek.com/virtual-event-today-ciso-forum-2025-virtual-summit/",
      "summary": "The CISO Forum Virtual Summit brought together CISOs, researchers, and innovators to share practical insights and strategies.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "watch-on-demand-ciso-forum-2025-virtual-summit",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "In Other News: Deepwatch Layoffs, macOS Vulnerability, Amazon AI Bug Bounty",
      "link": "https://www.securityweek.com/in-other-news-deepwatch-layoffs-macos-vulnerability-amazon-ai-bug-bounty/",
      "summary": "Other noteworthy stories that might have slipped under the radar: EchoGram attack undermines AI guardrails, Asahi brewer still crippled after ransomware attack, Sora 2 system prompt uncovered.",
      "tags": [
        "vulnerability",
        "ransomware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "in-other-news-deepwatch-layoffs-macos-vulnerabilit",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "Checkout.com Discloses Data Breach After Extortion Attempt",
      "link": "https://www.securityweek.com/checkout-com-discloses-data-breach-after-extortion-attempt/",
      "summary": "The information was stolen from a legacy cloud file storage system, not from its payment processing platform.",
      "tags": [
        "breach"
      ],
      "urgency": "Medium",
      "slug": "checkoutcom-discloses-data-breach-after-extortion-",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "Washington Post Says Nearly 10,000 Employees Impacted by Oracle Hack",
      "link": "https://www.securityweek.com/washington-post-says-nearly-10000-employees-impacted-by-oracle-hack/",
      "summary": "The media company admitted that cybercriminals attempted to extort a payment after stealing personal information.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "washington-post-says-nearly-10000-employees-impact",
      "source": "SecurityWeek",
      "date": "2025-11-15"
    },
    {
      "title": "Logitech confirms data breach after Clop extortion attack",
      "link": "https://www.bleepingcomputer.com/news/security/logitech-confirms-data-breach-after-clop-extortion-attack/",
      "summary": "Hardware accessory giant Logitech has confirmed it suffered a data breach in a cyberattack claimed by the Clop extortion gang, which conducted Oracle E-Business Suite data theft attacks in July.",
      "tags": [
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "logitech-confirms-data-breach-after-clop-extortion",
      "source": "BleepingComputer",
      "date": "2025-11-15"
    },
    {
      "title": "Five plead guilty to helping North Koreans infiltrate US firms",
      "link": "https://www.bleepingcomputer.com/news/security/five-plead-guilty-to-helping-north-koreans-infiltrate-us-firms/",
      "summary": "The U.S. Department of Justice announced that five individuals pleaded guilty to aiding North Korea's illicit revenue generation schemes, including remote IT worker fraud and cryptocurrency theft.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "five-plead-guilty-to-helping-north-koreans-infiltr",
      "source": "BleepingComputer",
      "date": "2025-11-15"
    },
    {
      "title": "5 Critical Google Workspace Security Settings You Could Be Missing",
      "link": "https://www.bleepingcomputer.com/go/66/",
      "summary": "A checklist for securing Google Workspace.",
      "tags": [
        "critical"
      ],
      "urgency": "High",
      "slug": "5-critical-google-workspace-security-settings-you-",
      "source": "BleepingComputer",
      "date": "2025-11-15"
    },
    {
      "title": "Anthropic claims of Claude AI-automated cyberattacks met with doubt",
      "link": "https://www.bleepingcomputer.com/news/security/anthropic-claims-of-claude-ai-automated-cyberattacks-met-with-doubt/",
      "summary": "Anthropic reports that a Chinese state-sponsored threat group, tracked as GTG-1002, carried out a cyber-espionage operation that was largely automated through the abuse of the company's Claude Code AI model.",
      "tags": [
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "anthropic-claims-of-claude-ai-automated-cyberattac",
      "source": "BleepingComputer",
      "date": "2025-11-15"
    }
  ]
}