{
  "date": "2025-11-28",
  "items": [
    {
      "title": "MS Teams Guest Access Can Remove Defender Protection When Users Join External Tenants",
      "link": "https://thehackernews.com/2025/11/ms-teams-guest-access-can-remove.html",
      "summary": "Cybersecurity researchers have shed light on a cross-tenant blind spot that allows attackers to bypass Microsoft Defender for Office 365 protections via the guest access  feature in Teams.  \"When users operate as guests in another tenant, their protections are determined entirely by that hosting environment, not by their home organization,\" Ontinue security researcher Rhys Downing said  in a report.  \"These advancements increase collaboration opportunities, but they also widen the responsibility for ensuring those external environments are trustworthy and properly secured.\"  The development comes as Microsoft has begun rolling out a new feature in Teams that allows users to chat with anyone via email, including those who don't use the enterprise communications platform, starting this month. The change is expected to be globally available by January 2026.   \"The recipient will receive an email invitation to join the chat session as a guest, enabling seamles...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "ms-teams-guest-access-can-remove-defender-protecti",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "Bloody Wolf Expands Java-based NetSupport RAT Attacks in Kyrgyzstan and Uzbekistan",
      "link": "https://thehackernews.com/2025/11/bloody-wolf-expands-java-based.html",
      "summary": "The threat actor known as Bloody Wolf  has been attributed to a cyber attack campaign that has targeted Kyrgyzstan since at least June 2025 with the goal of delivering NetSupport RAT.  As of October 2025, the activity has expanded to also single out Uzbekistan, Group-IB researchers Amirbek Kurbanov and Volen Kayo said in a report published in collaboration with Ukuk, a state enterprise under the Prosecutor General's office of the Kyrgyz Republic. The attacks have targeted finance, government, and information technology (IT) sectors.  \"Those threat actors would impersonate the [Kyrgyzstan's] Ministry of Justice through official looking PDF documents and domain names, which in turn hosted malicious Java Archive (JAR) files designed to deploy the NetSupport RAT,\" the Singapore-headquartered company said .  \"This combination of social engineering and accessible tooling allows Bloody Wolf to remain effective while keeping a low operational profile.\"   Bloody Wol...",
      "tags": [
        "phishing",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "bloody-wolf-expands-java-based-netsupport-rat-atta",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "Microsoft to Block Unauthorized Scripts in Entra ID Logins with 2026 CSP Update",
      "link": "https://thehackernews.com/2025/11/microsoft-to-block-unauthorized-scripts.html",
      "summary": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now.  The update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"login.microsoftonline[.]com\" by only letting scripts from trusted Microsoft domains run.  \"This update strengthens security and adds an extra layer of protection by allowing only scripts from trusted Microsoft domains to run during authentication, blocking unauthorized or injected code from executing during the sign-in experience,\" the Windows maker said .  Specifically, it only allows script downloads from Microsoft trusted CDN domains and inline script execution from a Microsoft trusted source. The updated policy is limited to browser-based sign-in experiences for URLs beginning with login.microsoftonline.com. Microsoft Entra External ID will not be affected.   The change, which has been described as a proacti...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "microsoft-to-block-unauthorized-scripts-in-entra-i",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "Webinar: Learn to Spot Risks and Patch Safely with Community-Maintained Tools",
      "link": "https://thehackernews.com/2025/11/webinar-learn-to-spot-risks-and-patch.html",
      "summary": "If you're using community tools like Chocolatey or Winget to keep systems updated, you're not alone. These platforms are fast, flexible, and easy to work with—making them favorites for IT teams. But there's a catch...  The very tools that make your job easier might also be the reason your systems are at risk.  These tools are run by the community. That means anyone can add or update packages. Some packages may be old, missing safety checks, or changed by mistake or on purpose. Hackers look for these weak spots. This has already happened in places like NPM and PyPI. The same risks can happen with Windows tools too.  To help you patch safely without slowing down, there's a free webinar coming up . It's led by Gene Moody, Field CTO at Action1 . He'll walk through how these tools work, where the risks are, and how to protect your systems while keeping updates on track.  In this session, he'll test how safe these tools really are. You'll get practical steps you can use right away—n...",
      "tags": [
        "vulnerability"
      ],
      "urgency": "Low",
      "slug": "webinar-learn-to-spot-risks-and-patch-safely-with-",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "ThreatsDay Bulletin: AI Malware, Voice Bot Flaws, Crypto Laundering, IoT Attacks — and 20 More Stories",
      "link": "https://thehackernews.com/2025/11/threatsday-bulletin-ai-malware-voice.html",
      "summary": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there's a lot happening in the cyber world.  Criminals are getting creative — using smart tricks to steal data, sound real, and hide in plain sight. But they're not the only ones moving fast. Governments and security teams are fighting back, shutting down fake networks, banning risky projects, and tightening digital defenses.  Here's a quick look at what's making waves this week — the biggest hacks, the new threats, and the wins worth knowing about.                   Mirai-based malware resurfaces with new IoT campaign             ShadowV2 Botnet Continues to Target IoT Devices                  The threat actors behind the Mirai-based ShadowV2  botnet have been observed infecting IoT devices across industries and continents. The campaign is said to have been active only during the Amazon Web Services (AWS) outage  in late October 2025. It's assessed ...",
      "tags": [
        "malware",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "threatsday-bulletin-ai-malware-voice-bot-flaws-cry",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "Gainsight Expands Impacted Customer List Following Salesforce Security Alert",
      "link": "https://thehackernews.com/2025/11/gainsight-expands-impacted-customer.html",
      "summary": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought.  The company said  Salesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list\" as of November 21, 2025. It did not reveal the exact number of customers who were impacted, but its CEO, Chuck Ganapathi, said  \"we presently know of only a handful of customers who had their data affected.\"  The development comes as Salesforce warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform, prompting the company to revoke all access and refresh tokens associated with them. The breach has been claimed by a notorious cybercrime group known as ShinyHunters (aka Bling Libra).  A number of other precautionary steps have been enacted to contain the incident. This includes Zendesk, Gong.io, and HubSpot temporarily suspending their Gainsight...",
      "tags": [
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "gainsight-expands-impacted-customer-list-following",
      "source": "The Hacker News",
      "date": "2025-11-28"
    },
    {
      "title": "Asahi Data Breach Impacts 2 Million Individuals",
      "link": "https://www.securityweek.com/asahi-data-breach-impacts-2-million-individuals/",
      "summary": "Hackers stole the personal information of customers and employees before deploying ransomware and crippling Asahi’s operations in Japan.",
      "tags": [
        "ransomware",
        "breach"
      ],
      "urgency": "Medium",
      "slug": "asahi-data-breach-impacts-2-million-individuals",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "OpenAI User Data Exposed in Mixpanel Hack",
      "link": "https://www.securityweek.com/openai-user-data-exposed-in-mixpanel-hack/",
      "summary": "Multiple Mixpanel customers were impacted by a recent cyberattack targeting the product analytics company.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "openai-user-data-exposed-in-mixpanel-hack",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "Clover Security Raises $36 Million to Secure Software by Design",
      "link": "https://www.securityweek.com/clover-security-raises-36-million-to-secure-software-by-design/",
      "summary": "The cybersecurity startup embeds AI agents into widely used tools to identify design flaws and eliminate them early.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "clover-security-raises-36-million-to-secure-softwa",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "Account Takeover Fraud Caused $262 Million in Losses in 2025: FBI",
      "link": "https://www.securityweek.com/account-takeover-fraud-caused-262-million-in-losses-in-2025-fbi/",
      "summary": "Cybercriminals impersonating financial institutions have targeted individuals, businesses, and organizations of different sizes.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "account-takeover-fraud-caused-262-million-in-losse",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "Thousands of Secrets Leaked on Code Formatting Platforms",
      "link": "https://www.securityweek.com/thousands-of-secrets-leaked-on-code-formatting-platforms/",
      "summary": "JSONFormatter and CodeBeautify users exposed credentials, authentication keys, configuration information, private keys, and other secrets.",
      "tags": [
        "breach"
      ],
      "urgency": "Low",
      "slug": "thousands-of-secrets-leaked-on-code-formatting-pla",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "Cybersecurity Is Now a Core Business Discipline",
      "link": "https://www.securityweek.com/cybersecurity-is-now-a-core-business-discipline/",
      "summary": "Boardroom conversations about cyber can no longer be siloed apart from strategy, operations, or geopolitics.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "cybersecurity-is-now-a-core-business-discipline",
      "source": "SecurityWeek",
      "date": "2025-11-28"
    },
    {
      "title": "Prepare for CISSP certification with this training bundle for $20",
      "link": "https://www.bleepingcomputer.com/offer/deals/prepare-for-cissp-certification-with-this-training-bundle-for-20/",
      "summary": "The CISSP Security & Risk Management Training Bundle offers eight courses covering all domains of the Certified Information Systems Security Professional exam for just $19.97, down from the regular price of $424. That's 95% off for everything you need to prepare for the exam in one purchase.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "prepare-for-cissp-certification-with-this-training",
      "source": "BleepingComputer",
      "date": "2025-11-28"
    },
    {
      "title": "Malicious LLMs empower inexperienced hackers with advanced tools",
      "link": "https://www.bleepingcomputer.com/news/security/malicious-llms-empower-inexperienced-hackers-with-advanced-tools/",
      "summary": "Unrestricted large language models (LLMs) like WormGPT 4 and KawaiiGPT are improving their capabilities to generate malicious code, delivering functional scripts for ransomware encryptors and lateral movement.",
      "tags": [
        "ransomware"
      ],
      "urgency": "Medium",
      "slug": "malicious-llms-empower-inexperienced-hackers-with-",
      "source": "BleepingComputer",
      "date": "2025-11-28"
    },
    {
      "title": "New Webinar: How phishing attacks evolved in 2025",
      "link": "https://pushsecurity.com/webinar/phishing-2025-review?utm_source=bleepingcomputer&utm_medium=sponsored-content&utm_term=ad",
      "summary": "This year, we've seen a huge amount of phishing evolution, with new techniques, toolkits, and delivery methods identified every day.",
      "tags": [
        "phishing",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-webinar-how-phishing-attacks-evolved-in-2025",
      "source": "BleepingComputer",
      "date": "2025-11-28"
    },
    {
      "title": "GreyNoise launches free scanner to check if you're part of a botnet",
      "link": "https://www.bleepingcomputer.com/news/security/greynoise-launches-free-scanner-to-check-if-youre-part-of-a-botnet/",
      "summary": "GreyNoise Labs has launched a free tool called GreyNoise IP Check that lets users check if their IP address has been observed in malicious scanning operations, like botnet and residential proxy networks.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "greynoise-launches-free-scanner-to-check-if-youre-",
      "source": "BleepingComputer",
      "date": "2025-11-28"
    }
  ]
}