{
  "date": "2025-12-19",
  "items": [
    {
      "title": "New UEFI Flaw Enables Early-Boot DMA Attacks on ASRock, ASUS, GIGABYTE, MSI Motherboards",
      "link": "https://thehackernews.com/2025/12/new-uefi-flaw-enables-early-boot-dma.html",
      "summary": "Certain motherboard models from vendors like ASRock, ASUSTeK Computer, GIGABYTE, and MSI are affected by a security vulnerability that leaves them susceptible to early-boot direct memory access ( DMA ) attacks across architectures that implement a Unified Extensible Firmware Interface ( UEFI ) and input–output memory management unit ( IOMMU ).  UEFI and IOMMU are designed to enforce a security foundation and prevent peripherals from performing unauthorized memory accesses, effectively ensuring that DMA-capable devices can manipulate or inspect system memory before the operating system is loaded.   The vulnerability, discovered by Nick Peterson and Mohamed Al-Sharifi of Riot Games in certain UEFI implementations, has to do with a discrepancy in the DMA protection status. While the firmware indicates that DMA protection is active, it fails to configure and enable the IOMMU during the critical boot phase.   \"This gap allows a malicious DMA-capable Peripheral Component Interconnect E...",
      "tags": [
        "vulnerability",
        "attack",
        "critical"
      ],
      "urgency": "High",
      "slug": "new-uefi-flaw-enables-early-boot-dma-attacks-on-as",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "China-Aligned Threat Group Uses Windows Group Policy to Deploy Espionage Malware",
      "link": "https://thehackernews.com/2025/12/china-aligned-threat-group-uses-windows.html",
      "summary": "A previously undocumented China-aligned threat cluster dubbed LongNosedGoblin has been attributed to a series of cyber attacks targeting governmental entities in Southeast Asia and Japan.  The end goal of these attacks is cyber espionage, Slovak cybersecurity company ESET said in a report published today. The threat activity cluster has been assessed to be active since at least September 2023.  \"LongNosedGoblin uses Group Policy to deploy malware across the compromised network, and cloud services (e.g., Microsoft OneDrive and Google Drive) as command and control (C&C) servers,\" security researchers Anton Cherepanov and Peter Strýček said .  Group Policy  is a mechanism for managing settings and permissions on Windows machines. According to Microsoft, Group Policy can be used to define configurations for groups of users and client computers, as well as manage server computers.   The attacks are characterized by the use of a varied custom toolset that mainly consists of C#...",
      "tags": [
        "malware",
        "breach",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "china-aligned-threat-group-uses-windows-group-poli",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "HPE OneView Flaw Rated CVSS 10.0 Allows Unauthenticated Remote Code Execution",
      "link": "https://thehackernews.com/2025/12/hpe-oneview-flaw-rated-cvss-100-allows.html",
      "summary": "Hewlett Packard Enterprise (HPE) has resolved a maximum-severity security flaw in OneView Software that, if successfully exploited, could result in remote code execution.  The critical vulnerability, assigned the CVE identifier CVE-2025-37164 , carries a CVSS score of 10.0. HPE OneView  is an IT infrastructure management software that streamlines IT operations and controls all systems via a centralized dashboard interface.  \"A potential security vulnerability has been identified in Hewlett Packard Enterprise OneView Software. This vulnerability could be exploited, allowing a remote unauthenticated user to perform remote code execution,\" HPE said  in an advisory issued this week.   It affects all versions of the software prior to version 11.00 , which addresses the flaw. The company has also made available a hotfix that can be applied to OneView versions 5.20 through 10.20.  It's worth noting that the hotfix must be reapplied after upgrading from version 6.60 or later to ...",
      "tags": [
        "vulnerability",
        "critical"
      ],
      "urgency": "High",
      "slug": "hpe-oneview-flaw-rated-cvss-100-allows-unauthentic",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "ThreatsDay Bulletin: WhatsApp Hijacks, MCP Leaks, AI Recon, React2Shell Exploit and 15 More Stories",
      "link": "https://thehackernews.com/2025/12/threatsday-bulletin-whatsapp-hijacks.html",
      "summary": "This week's ThreatsDay Bulletin tracks how attackers keep reshaping old tools and finding new angles in familiar systems. Small changes in tactics are stacking up fast, and each one hints at where the next big breach could come from.  From shifting infrastructures to clever social hooks, the week's activity shows just how fluid the threat landscape has become.  Here's the full rundown of what moved in the cyber world this week.",
      "tags": [
        "vulnerability",
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "threatsday-bulletin-whatsapp-hijacks-mcp-leaks-ai-",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "North Korea-Linked Hackers Steal $2.02 Billion in 2025, Leading Global Crypto Theft",
      "link": "https://thehackernews.com/2025/12/north-korea-linked-hackers-steal-202.html",
      "summary": "Threat actors with ties to the Democratic People's Republic of Korea (DPRK or North Korea) have been instrumental in driving a surge in global cryptocurrency theft in 2025, accounting for at least $2.02 billion out of more than $3.4 billion stolen from January through early December.  The figure represents a 51% increase year-over-year and $681 million more than 2024, when the threat actors stole $1.3 billion, according to Chainalysis' Crypto Crime Report shared with The Hacker News.  \"This marks the most severe year on record for DPRK crypto theft in terms of value stolen, with DPRK attacks also accounting for a record 76% of all service compromises,\" the blockchain intelligence company said . \"Overall, 2025's numbers bring the lower-bound cumulative estimate for cryptocurrency funds stolen by the DPRK to $6.75 billion.\"  The February compromise  of cryptocurrency exchange Bybit alone is responsible for $1.5 billion of the $2.02 billion plundered by North ...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "north-korea-linked-hackers-steal-202-billion-in-20",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "The Case for Dynamic AI-SaaS Security as Copilots Scale",
      "link": "https://thehackernews.com/2025/12/the-case-for-dynamic-ai-saas-security.html",
      "summary": "Within the past year, artificial intelligence copilots and agents have quietly permeated the SaaS applications businesses use every day. Tools like Zoom, Slack, Microsoft 365, Salesforce, and ServiceNow now come with built-in AI assistants or agent-like features. Virtually every major SaaS vendor has rushed to embed AI into their offerings.  The result is an explosion of AI capabilities across the SaaS stack, a phenomenon of AI sprawl  where AI tools proliferate without centralized oversight. For security teams, this represents a shift. As these AI copilots scale up in use, they are changing how data moves through SaaS. An AI agent can connect multiple apps and automate tasks across them, effectively creating new integration pathways on the fly.  An AI meeting assistant might automatically pull in documents from SharePoint to summarize in an email, or a sales AI might cross-reference CRM data with financial records in real time. These AI data connections form complex, dynamic pathways...",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "the-case-for-dynamic-ai-saas-security-as-copilots-",
      "source": "The Hacker News",
      "date": "2025-12-19"
    },
    {
      "title": "UEFI Vulnerability in Major Motherboards Enables Early-Boot Attacks",
      "link": "https://www.securityweek.com/uefi-vulnerability-in-major-motherboards-enables-early-boot-attacks/",
      "summary": "ASRock, Asus, Gigabyte, and MSI motherboards are vulnerable to early-boot DMA attacks.",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "uefi-vulnerability-in-major-motherboards-enables-e",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "HPE Patches Critical Flaw in IT Infrastructure Management Software",
      "link": "https://www.securityweek.com/hpe-patches-critical-flaw-in-it-infrastructure-management-software/",
      "summary": "Tracked as CVE-2025-37164, the critical flaw could allow unauthenticated, remote attackers to execute arbitrary code.",
      "tags": [
        "vulnerability",
        "attack",
        "critical"
      ],
      "urgency": "High",
      "slug": "hpe-patches-critical-flaw-in-it-infrastructure-man",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "CISA Warns of Exploited Flaw in Asus Update Tool",
      "link": "https://www.securityweek.com/cisa-warns-of-exploited-flaw-in-asus-update-tool/",
      "summary": "Tracked as CVE-2025-59374, the issue is a software backdoor implanted in Asus Live Update in a supply chain attack.",
      "tags": [
        "vulnerability",
        "malware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "cisa-warns-of-exploited-flaw-in-asus-update-tool",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "113,000 Impacted by Data Breach at Virginia Mental Health Authority",
      "link": "https://www.securityweek.com/113000-impacted-by-data-breach-at-virginia-mental-health-authority/",
      "summary": "Threat actors stole names, Social Security numbers, and financial and health information, and deployed ransomware on RBHA’s systems.",
      "tags": [
        "ransomware",
        "breach"
      ],
      "urgency": "Medium",
      "slug": "113000-impacted-by-data-breach-at-virginia-mental-",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "IoT Security Firm Exein Raises €100 Million",
      "link": "https://www.securityweek.com/iot-security-firm-exein-raises-e100-million/",
      "summary": "The Italian company has raised nearly $200 million in 2025 for its widely used embedded cybersecurity platform.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "iot-security-firm-exein-raises-100-million",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "France Probes ‘Foreign Interference’ After Remote Control Malware Found on Passenger Ferry",
      "link": "https://www.securityweek.com/france-probes-foreign-interference-after-remote-control-malware-found-on-passenger-ferry/",
      "summary": "France’s counterespionage agency is investigating a suspected cyberattack plot targeting an international passenger ferry",
      "tags": [
        "malware",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "france-probes-foreign-interference-after-remote-co",
      "source": "SecurityWeek",
      "date": "2025-12-19"
    },
    {
      "title": "Windows 10 OOB update released to fix Message Queuing (MSMQ) issues",
      "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-oob-update-released-to-fix-message-queuing-msmq-issues/",
      "summary": "This month's extended security update for Windows 11 broke Message Queuing (MSMQ), which is typically used by enterprises to manage background tasks.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "windows-10-oob-update-released-to-fix-message-queu",
      "source": "BleepingComputer",
      "date": "2025-12-19"
    },
    {
      "title": "University of Sydney suffers data breach exposing student and staff info",
      "link": "https://www.bleepingcomputer.com/news/security/university-of-sydney-suffers-data-breach-exposing-student-and-staff-info/",
      "summary": "Hackers gained access to an online coding repository belonging to the University of Sydney and stole files with personal information of staff and students.",
      "tags": [
        "breach"
      ],
      "urgency": "Medium",
      "slug": "university-of-sydney-suffers-data-breach-exposing-",
      "source": "BleepingComputer",
      "date": "2025-12-19"
    },
    {
      "title": "New Webinar: Choose Your Own Investigation — Browser Attack Edition",
      "link": "https://pushsecurity.com/webinar/investigating-browser-threats?utm_source=bleeping-computer&utm_medium=sponsored-content&utm_term=ad",
      "summary": "Modern attacks have shifted focus to the browser, yet detection tools remain largely blind to the crucial activity happening there.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-webinar-choose-your-own-investigation-browser-",
      "source": "BleepingComputer",
      "date": "2025-12-19"
    },
    {
      "title": "Clop ransomware targets Gladinet CentreStack in data theft attacks",
      "link": "https://www.bleepingcomputer.com/news/security/clop-ransomware-targets-gladinet-centrestack-servers-for-extortion/",
      "summary": "The Clop ransomware gang is targeting Internet-exposed Gladinet CentreStack file servers in a new data theft extortion campaign.",
      "tags": [
        "ransomware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "clop-ransomware-targets-gladinet-centrestack-in-da",
      "source": "BleepingComputer",
      "date": "2025-12-19"
    }
  ]
}