{
  "date": "2026-01-25",
  "items": [
    {
      "title": "Multi-Stage Phishing Campaign Targets Russia with Amnesia RAT and Ransomware",
      "link": "https://thehackernews.com/2026/01/multi-stage-phishing-campaign-targets.html",
      "summary": "A new multi-stage phishing campaign has been observed targeting users in Russia with ransomware and a remote access trojan called Amnesia RAT.  \"The attack begins with social engineering lures delivered via business-themed documents crafted to appear routine and benign,\" Fortinet FortiGuard Labs researcher Cara Lin said  in a technical breakdown published this week. \"These documents and accompanying scripts serve as visual distractions, diverting victims to fake tasks or status messages while malicious activity runs silently in the background.\"  The campaign stands out for a couple of reasons. First, it uses multiple public cloud services to distribute different kinds of payloads. While GitHub is mainly used to distribute scripts, binary payloads are staged on Dropbox. This separation complicates takedown efforts, effectively improving resilience.  Another \"defining characteristic\" of the campaign, per Fortinet, is the operational abuse of defendnot  to d...",
      "tags": [
        "malware",
        "phishing",
        "ransomware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "multi-stage-phishing-campaign-targets-russia-with-",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "New DynoWiper Malware Used in Attempted Sandworm Attack on Polish Power Sector",
      "link": "https://thehackernews.com/2026/01/new-dynowiper-malware-used-in-attempted.html",
      "summary": "The Russian nation-state hacking group known as Sandworm has been attributed to what has been described as the \"largest cyber attack\" targeting Poland's power system in the last week of December 2025.  The attack was unsuccessful, the country's energy minister, Milosz Motyka, said  last week.  \"The command of the cyberspace forces has diagnosed in the last days of the year the strongest attack on the energy infrastructure in years,\" Motyka was quoted as saying.   According to a new report  by ESET, the attack was the work of Sandworm, which deployed a previously undocumented wiper malware codenamed DynoWiper . The links to Sandworm are based on overlaps with prior wiper activity associated with the adversary, particularly in the aftermath  of Russia's military invasion  of Ukraine  in February 2022.  The Slovakian cybersecurity company, which identified the use of the wiper as part of the attempted disruptive attack aimed at the Polish energy sector on ...",
      "tags": [
        "malware",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-dynowiper-malware-used-in-attempted-sandworm-a",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "Who Approved This Agent? Rethinking Access, Accountability, and Risk in the Age of AI Agents",
      "link": "https://thehackernews.com/2026/01/who-approved-this-agent-rethinking.html",
      "summary": "AI agents are accelerating how work gets done. They schedule meetings, access data, trigger workflows, write code, and take action in real time, pushing productivity beyond human speed across the enterprise.  Then comes the moment every security team eventually hits:  \"Wait… who approved this?\"  Unlike users or applications, AI agents are often deployed quickly, shared broadly, and granted wide access permissions, making ownership, approval, and accountability difficult to trace. What was once a straightforward question is now surprisingly hard to answer.  AI Agents Break Traditional Access Models  AI agents are not just another type of user. They fundamentally differ from both humans and traditional service accounts, and those differences are what break existing access and approval models.  Human access is built around clear intent. Permissions are tied to a role, reviewed periodically, and constrained by time and context. Service accounts, while non-human, are typ...",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "who-approved-this-agent-rethinking-access-accounta",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "CISA Adds Actively Exploited VMware vCenter Flaw CVE-2024-37079 to KEV Catalog",
      "link": "https://thehackernews.com/2026/01/cisa-adds-actively-exploited-vmware.html",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added  a critical security flaw affecting Broadcom VMware vCenter Server that was patched in June 2024 to its Known Exploited Vulnerabilities ( KEV ) catalog, citing evidence of active exploitation in the wild.  The vulnerability in question is CVE-2024-37079  (CVSS score: 9.8), which refers to a heap overflow in the implementation of the DCE/RPC protocol  that could allow a bad actor with network access to vCenter Server to achieve remote code execution by sending a specially crafted network packet.  It was resolved by Broadcom in June 2024, along with CVE-2024-37080, another heap overflow in the implementation of the DCE/RPC protocol that could lead to remote code execution. Chinese cybersecurity company QiAnXin LegendSec researchers Hao Zheng and Zibo Li were credited with discovering and reporting the issues.   In a presentation  at the Black Hat Asia security conference in April 2025, the researchers said ...",
      "tags": [
        "vulnerability",
        "critical"
      ],
      "urgency": "High",
      "slug": "cisa-adds-actively-exploited-vmware-vcenter-flaw-c",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "CISA Updates KEV Catalog with Four Actively Exploited Software Vulnerabilities",
      "link": "https://thehackernews.com/2026/01/cisa-updates-kev-catalog-with-four.html",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added  four security flaws to its Known Exploited Vulnerabilities ( KEV ) catalog, citing evidence of active exploitation in the wild.  The list of vulnerabilities is as follows -   CVE-2025-68645  (CVSS score: 8.8) - A PHP remote file inclusion  vulnerability in Synacor Zimbra Collaboration Suite (ZCS) that could allow a remote attacker to craft requests to the \"/h/rest\" endpoint and allow inclusion of arbitrary files from the WebRoot directory without any authentication (Fixed in November 2025 with version 10.1.13 )  CVE-2025-34026  (CVSS score: 9.2) - An authentication bypass  in the Versa Concerto SD-WAN orchestration platform that could allow an attacker to access administrative endpoints (Fixed in April 2025 with version 12.2.1 GA )  CVE-2025-31125  (CVSS score: 5.3) - An improper access control vulnerability in Vite Vitejs that could allow contents of arbitrary files to be returned to the bro...",
      "tags": [
        "vulnerability",
        "attack",
        "critical"
      ],
      "urgency": "High",
      "slug": "cisa-updates-kev-catalog-with-four-actively-exploi",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "Fortinet Confirms Active FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
      "link": "https://thehackernews.com/2026/01/fortinet-confirms-active-forticloud-sso.html",
      "summary": "Fortinet has officially confirmed that it's working to completely plug a FortiCloud SSO authentication bypass vulnerability following reports of fresh exploitation activity on fully-patched firewalls.  \"In the last 24 hours, we have identified a number of cases where the exploit was to a device that had been fully upgraded to the latest release at the time of the attack, which suggested a new attack path,\" Fortinet Chief Information Security Officer (CISO) Carl Windsor said  in a Thursday post.  The activity essentially mounts to a bypass for patches put in place by the network security vendor to address CVE-2025-59718 and CVE-2025-59719 , which could allow unauthenticated bypass of SSO login authentication via crafted SAML messages if the FortiCloud SSO feature is enabled on affected devices. The issues were originally addressed by Fortinet last month.  However, earlier this week, reports emerged  of renewed activity in which malicious SSO logins on FortiGate appliances...",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "fortinet-confirms-active-forticloud-sso-bypass-on-",
      "source": "The Hacker News",
      "date": "2026-01-25"
    },
    {
      "title": "Nike Probing Potential Security Incident as Hackers Threaten to Leak Data",
      "link": "https://www.securityweek.com/nike-probing-potential-security-incident-as-hackers-threaten-to-leak-data/",
      "summary": "The WorldLeaks cybercrime group claims to have stolen information from the footwear and apparel giant’s systems.",
      "tags": [
        "breach"
      ],
      "urgency": "Low",
      "slug": "nike-probing-potential-security-incident-as-hacker",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "Fortinet Confirms FortiCloud SSO Exploitation Against Patched Devices",
      "link": "https://www.securityweek.com/fortinet-confirms-forticloud-sso-exploitation-against-patched-devices/",
      "summary": "Similar to recent FortiCloud single sign-on (SSO) login vulnerabilities, the attacks bypass authentication.",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "fortinet-confirms-forticloud-sso-exploitation-agai",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "In Other News: €1.2B GDPR Fines, Net-NTLMv1 Rainbow Tables, Rockwell Security Notice",
      "link": "https://www.securityweek.com/in-other-news-e1-2b-gdpr-fines-net-ntlmv1-rainbow-tables-rockwell-security-notice/",
      "summary": "Other noteworthy stories that might have slipped under the radar: Cloudflare WAF bypass, Canonical Snap Store abused for malware delivery, Curl terminating bug bounty program",
      "tags": [
        "malware"
      ],
      "urgency": "Low",
      "slug": "in-other-news-12b-gdpr-fines-net-ntlmv1-rainbow-ta",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "Phishers Abuse SharePoint in New Campaign Targeting Energy Sector",
      "link": "https://www.securityweek.com/phishers-abuse-sharepoint-in-new-campaign-targeting-energy-sector/",
      "summary": "Threat actors are leveraging the file-sharing service for payload delivery in AitM phishing and BEC attacks.",
      "tags": [
        "phishing",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "phishers-abuse-sharepoint-in-new-campaign-targetin",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "Cyber Insights 2026: Regulations and the Tangled Mess of Compliance Requirements",
      "link": "https://www.securityweek.com/cyber-insights-2026-regulations-and-the-tangled-mess-of-compliance-requirements/",
      "summary": "Cyber regulations are where politics meets business – where business becomes subject to political realities.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "cyber-insights-2026-regulations-and-the-tangled-me",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "Under Armour Looking Into Data Breach Affecting Customers’ Email Addresses",
      "link": "https://www.securityweek.com/under-armour-looking-into-data-breach-affecting-customers-email-addresses/",
      "summary": "Under Armour is investigating a recent data breach that purloined customers’ email addresses and other personal information.",
      "tags": [
        "breach"
      ],
      "urgency": "Medium",
      "slug": "under-armour-looking-into-data-breach-affecting-cu",
      "source": "SecurityWeek",
      "date": "2026-01-25"
    },
    {
      "title": "Microsoft releases emergency OOB update to fix Outlook freezes",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-oob-update-to-fix-outlook-freezes/",
      "summary": "Microsoft has released emergency, out-of-band updates on Saturday for Windows 10, Windows 11, and Windows Server to fix an issue that prevented Microsoft Outlook classic from opening when using PSTs stored in cloud storage.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "High",
      "slug": "microsoft-releases-emergency-oob-update-to-fix-out",
      "source": "BleepingComputer",
      "date": "2026-01-25"
    },
    {
      "title": "Sandworm hackers linked to failed wiper attack on Poland’s energy systems",
      "link": "https://www.bleepingcomputer.com/news/security/sandworm-hackers-linked-to-failed-wiper-attack-on-polands-energy-systems/",
      "summary": "A cyberattack targeting Poland's power grid in late December 2025 has been linked to the Russian state-sponsored hacking group Sandworm, which attempted to deploy a new destructive data-wiping malware dubbed DynoWiper during the attack..",
      "tags": [
        "malware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "sandworm-hackers-linked-to-failed-wiper-attack-on-",
      "source": "BleepingComputer",
      "date": "2026-01-25"
    },
    {
      "title": "New Webinar: Choose Your Own Investigation — Browser Attack Edition",
      "link": "https://pushsecurity.com/webinar/investigating-browser-threats?utm_source=bleeping-computer&utm_medium=sponsored-content&utm_term=ad",
      "summary": "Modern attacks have shifted focus to the browser, yet detection tools remain largely blind to the crucial activity happening there.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-webinar-choose-your-own-investigation-browser-",
      "source": "BleepingComputer",
      "date": "2026-01-25"
    },
    {
      "title": "Konni hackers target blockchain engineers with AI-built malware",
      "link": "https://www.bleepingcomputer.com/news/security/konni-hackers-target-blockchain-engineers-with-ai-built-malware/",
      "summary": "The North Korean hacker group Konni (Opal Sleet, TA406) is using AI-generated PowerShell malware to target developers and engineers in the blockchain sector.",
      "tags": [
        "malware"
      ],
      "urgency": "Low",
      "slug": "konni-hackers-target-blockchain-engineers-with-ai-",
      "source": "BleepingComputer",
      "date": "2026-01-25"
    }
  ]
}