{
  "date": "2026-01-06",
  "items": [
    {
      "title": "New n8n Vulnerability (9.9 CVSS) Lets Authenticated Users Execute System Commands",
      "link": "https://thehackernews.com/2026/01/new-n8n-vulnerability-99-cvss-lets.html",
      "summary": "A new critical security vulnerability has been disclosed in n8n, an open-source workflow automation platform, that could enable an authenticated attacker to execute arbitrary system commands on the underlying host.  The vulnerability, tracked as CVE-2025-68668 , is rated 9.9 on the CVSS scoring system. It has been described as a case of a protection mechanism failure.  It affects n8n versions from 1.0.0 up to, but not including, 2.0.0, and allows an authenticated user with permission to create or modify workflows to execute arbitrary operating system commands on the host running n8n. The issue has been addressed in version 2.0.0.  \"A sandbox bypass vulnerability exists in the Python Code Node that uses Pyodide,\" an advisory for the flaw states . \"An authenticated user with permission to create or modify workflows can exploit this vulnerability to execute arbitrary commands on the host system running n8n, using the same privileges as the n8n process.\"   N8n said it ...",
      "tags": [
        "vulnerability",
        "attack",
        "critical"
      ],
      "urgency": "High",
      "slug": "new-n8n-vulnerability-99-cvss-lets-authenticated-u",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "Critical AdonisJS Bodyparser Flaw (CVSS 9.2) Enables Arbitrary File Write on Servers",
      "link": "https://thehackernews.com/2026/01/critical-adonisjs-bodyparser-flaw-cvss.html",
      "summary": "Users of the \" @adonisjs/bodyparser \" npm package are being advised to update to the latest version following the disclosure of a critical security vulnerability that, if successfully exploited, could allow a remote attacker to write arbitrary files on the server.  Tracked as CVE-2026-21440 (CVSS score: 9.2), the flaw has been described as a path traversal issue affecting the AdonisJS multipart file handling mechanism. \"@adonisjs/bodyparser\" is an npm package associated with AdonisJS, a Node.js framework for developing web apps and API servers with TypeScript. The library is used to process AdonisJS HTTP request body .  \"If a developer uses MultipartFile.move() without the second options argument or without explicitly sanitizing the filename, an attacker can supply a crafted filename value containing traversal sequences, writing to a destination path outside the intended upload directory,\" the project maintainers said  in an advisory released last week. ...",
      "tags": [
        "vulnerability",
        "attack",
        "critical"
      ],
      "urgency": "High",
      "slug": "critical-adonisjs-bodyparser-flaw-cvss-92-enables-",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "Russia-Aligned Hackers Abuse Viber to Target Ukrainian Military and Government",
      "link": "https://thehackernews.com/2026/01/russia-aligned-hackers-abuse-viber-to.html",
      "summary": "The Russia-aligned threat actor known as UAC-0184  has been observed targeting Ukrainian military and government entities by leveraging the Viber messaging platform to deliver malicious ZIP archives.  \"This organization has continued to conduct high-intensity intelligence gathering activities against Ukrainian military and government departments in 2025,\" the 360 Threat Intelligence Center said  in a technical report.  Also tracked as Hive0156, the hacking group is primarily known  for leveraging war-themed lures in phishing emails  to deliver Hijack Loader  in attacks targeting Ukrainian entities. The malware loader subsequently acts as a pathway for Remcos RAT infections.  The threat actor was first documented by CERT-UA in early January 2024. Subsequent attack campaigns have been found  to leverage messaging apps like Signal and Telegram as a delivery vehicle for malware. The latest findings from the Chinese security vendor points to a further evolution of this tactic.   ...",
      "tags": [
        "malware",
        "phishing",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "russia-aligned-hackers-abuse-viber-to-target-ukrai",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "Kimwolf Android Botnet Infects Over 2 Million Devices via Exposed ADB and Proxy Networks",
      "link": "https://thehackernews.com/2026/01/kimwolf-android-botnet-infects-over-2.html",
      "summary": "The botnet known as Kimwolf  has infected more than 2 million Android devices by tunneling through residential proxy networks, according to findings from Synthient.  \"Key actors involved in the Kimwolf botnet are observed monetizing the botnet through app installs, selling residential proxy bandwidth, and selling its DDoS functionality,\" the company said  in an analysis published last week.  Kimwolf was first publicly documented  by QiAnXin XLab last month, while documenting its connections to another botnet known as AISURU. Active since at least August 2025, Kimwolf is assessed to be an Android variant of AISURU. There is growing evidence to suggest that the botnet is actually behind a series of record-setting DDoS attacks  late last year.  The malware turns infected systems into conduits for relaying malicious traffic and orchestrating distributed denial-of-service (DDoS) attacks at scale. The vast majority of the infections are concentrated in Vietnam, Brazil, India, and ...",
      "tags": [
        "malware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "kimwolf-android-botnet-infects-over-2-million-devi",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "⚡ Weekly Recap: IoT Exploits, Wallet Breaches, Rogue Extensions, AI Abuse & More",
      "link": "https://thehackernews.com/2026/01/weekly-recap-iot-exploits-wallet.html",
      "summary": "The year opened without a reset. The same pressure carried over, and in some places it tightened. Systems people assume are boring or stable are showing up in the wrong places. Attacks moved quietly, reused familiar paths, and kept working longer than anyone wants to admit.  This week's stories share one pattern. Nothing flashy. No single moment. Just steady abuse of trust — updates, extensions, logins, messages — the things people click without thinking. That's where damage starts now.  This recap pulls those signals together. Not to overwhelm, but to show where attention slipped and why it matters early in the year.  ⚡ Threat of the Week  RondoDox Botnet Exploits React2Shell Flaw  — A persistent nine-month-long campaign has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as RondoDox. As of December 2025, the activity has been observed leveraging the recently disclosed React2Shell (CVE-2025-55182, CVSS score: 10.0) flaw as an initial...",
      "tags": [
        "vulnerability",
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "-weekly-recap-iot-exploits-wallet-breaches-rogue-e",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "The State of Cybersecurity in 2025: Key Segments, Insights, and Innovations",
      "link": "https://thehackernews.com/2026/01/the-state-of-cybersecurity-in-2025key.html",
      "summary": "Featuring:   Cybersecurity is being reshaped by forces that extend beyond individual threats or tools. As organizations operate across cloud infrastructure, distributed endpoints, and complex supply chains, security has shifted from a collection of point solutions to a question of architecture, trust, and execution speed.  This report examines how core areas of cybersecurity are evolving in response to that shift. Across authentication, endpoint security, software supply chain protection, network visibility, and human risk, it explores how defenders are adapting to adversaries that move faster, blend technical and social techniques, and exploit gaps between systems rather than weaknesses in any single control.  Download the Full Report Here:  https://papryon.live/report   Authentication — Yubico  Authentication is evolving from password-based verification to cryptographic proof of possession. As phishing and AI-driven impersonation scale, identity has become the primary control point ...",
      "tags": [
        "vulnerability",
        "phishing",
        "apt"
      ],
      "urgency": "Medium",
      "slug": "the-state-of-cybersecurity-in-2025-key-segments-in",
      "source": "The Hacker News",
      "date": "2026-01-06"
    },
    {
      "title": "Cybersecurity M&A Roundup: 30 Deals Announced in December 2025",
      "link": "https://www.securityweek.com/cybersecurity-ma-roundup-30-deals-announced-in-december-2025/",
      "summary": "Significant cybersecurity M&A deals announced by Akamai, Red Hat, Checkmarx, Silent Push, and ServiceNow.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "cybersecurity-ma-roundup-30-deals-announced-in-dec",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "Cyberattack Unlikely in Communications Failure That Grounded Flights in Greece",
      "link": "https://www.securityweek.com/cyberattack-unlikely-in-communications-failure-that-grounded-flights-in-greece/",
      "summary": "Flights across Greece were impacted for several hours after noise was reported on multiple air traffic communication channels.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "cyberattack-unlikely-in-communications-failure-tha",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "Brightspeed Investigating Cyberattack",
      "link": "https://www.securityweek.com/brightspeed-investigating-cyberattack/",
      "summary": "The hacking group Crimson Collective has claimed the theft of personal information pertaining to over 1 million Brightspeed customers.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "brightspeed-investigating-cyberattack",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "Sedgwick Confirms Cyberattack on Government Subsidiary",
      "link": "https://www.securityweek.com/sedgwick-confirms-cyberattack-on-government-subsidiary/",
      "summary": "Hackers have compromised a file transfer system at Sedgwick’s subsidiary that serves government agencies.",
      "tags": [
        "breach",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "sedgwick-confirms-cyberattack-on-government-subsid",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "CISA KEV Catalog Expanded 20% in 2025, Topping 1,480 Entries",
      "link": "https://www.securityweek.com/cisa-kev-catalog-expanded-20-in-2025-topping-1480-entries/",
      "summary": "With 24 new vulnerabilities known to be exploited by ransomware groups, the list now includes 1,484 software and hardware flaws.",
      "tags": [
        "vulnerability",
        "ransomware"
      ],
      "urgency": "Medium",
      "slug": "cisa-kev-catalog-expanded-20-in-2025-topping-1480-",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "Kimwolf Android Botnet Grows Through Residential Proxy Networks",
      "link": "https://www.securityweek.com/kimwolf-android-botnet-grows-through-residential-proxy-networks/",
      "summary": "The 2-million-device-strong botnet allows monetization through DDoS attacks, app installs, and the selling of proxy bandwidth.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "kimwolf-android-botnet-grows-through-residential-p",
      "source": "SecurityWeek",
      "date": "2026-01-06"
    },
    {
      "title": "Cloud file-sharing sites targeted for corporate data theft attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cloud-file-sharing-sites-targeted-for-corporate-data-theft-attacks/",
      "summary": "A threat actor known as Zestix has been offering to corporate data stolen from dozens of companies likely after breaching their ShareFile, Nextcloud, and OwnCloud instances.",
      "tags": [
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "cloud-file-sharing-sites-targeted-for-corporate-da",
      "source": "BleepingComputer",
      "date": "2026-01-06"
    },
    {
      "title": "ClickFix attack uses fake Windows BSOD screens to push malware",
      "link": "https://www.bleepingcomputer.com/news/security/clickfix-attack-uses-fake-windows-bsod-screens-to-push-malware/",
      "summary": "A new ClickFix social engineering campaign is targeting the hospitality sector in Europe, using fake Windows Blue Screen of Death (BSOD) screens to trick users into manually compiling and executing malware on their systems.",
      "tags": [
        "malware",
        "phishing",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "clickfix-attack-uses-fake-windows-bsod-screens-to-",
      "source": "BleepingComputer",
      "date": "2026-01-06"
    },
    {
      "title": "How to discover shadow AI [Free Guide]",
      "link": "https://www.bleepingcomputer.com/go/66/",
      "summary": "Your guide to mitigating shadow AI risks",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "how-to-discover-shadow-ai-free-guide",
      "source": "BleepingComputer",
      "date": "2026-01-06"
    },
    {
      "title": "US broadband provider Brightspeed investigates breach claims",
      "link": "https://www.bleepingcomputer.com/news/security/us-broadband-provider-brightspeed-investigates-breach-claims/",
      "summary": "Brightspeed, one of the largest fiber broadband companies in the United States, is investigating security breach and data theft claims made by the Crimson Collective extortion gang.",
      "tags": [
        "breach"
      ],
      "urgency": "Medium",
      "slug": "us-broadband-provider-brightspeed-investigates-bre",
      "source": "BleepingComputer",
      "date": "2026-01-06"
    }
  ]
}