{
  "date": "2026-01-19",
  "items": [
    {
      "title": "CrashFix Chrome Extension Delivers ModeloRAT Using ClickFix-Style Browser Crash Lures",
      "link": "https://thehackernews.com/2026/01/crashfix-chrome-extension-delivers.html",
      "summary": "Cybersecurity researchers have disclosed details of an ongoing campaign dubbed KongTuke that used a malicious Google Chrome extension masquerading as an ad blocker to deliberately crash the web browser and trick victims into running arbitrary commands using ClickFix -like lures to deliver a previously undocumented remote access trojan (RAT) dubbed ModeloRAT.  This new escalation of ClickFix has been codenamed CrashFix  by Huntress.  KongTuke , also tracked as 404 TDS, Chaya_002, LandUpdate808, and TAG-124, is the name given to a traffic distribution system (TDS) known for profiling victim hosts before redirecting them to a payload delivery site that infects their systems. Access to these compromised hosts is then handed off to other threat actors, including ransomware groups, for follow-on malware delivery.  Some of the cybercriminal groups that have leveraged TAG-124 infrastructure include Rhysida ransomware , Interlock ransomware , and TA866  (aka Asylum Ambuscade), with the threat ...",
      "tags": [
        "malware",
        "ransomware",
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "crashfix-chrome-extension-delivers-modelorat-using",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "Security Bug in StealC Malware Panel Let Researchers Spy on Threat Actor Operations",
      "link": "https://thehackernews.com/2026/01/security-bug-in-stealc-malware-panel.html",
      "summary": "Cybersecurity researchers have disclosed a cross-site scripting (XSS) vulnerability in the web-based control panel used by operators of the StealC information stealer, allowing them to gather crucial insights on one of the threat actors using the malware in their operations.  \"By exploiting it, we were able to collect system fingerprints, monitor active sessions, and – in a twist that will surprise no one – steal cookies from the very infrastructure designed to steal them,\" CyberArk researcher Ari Novick said  in a report published last week.  StealC is an information stealer that first emerged  in January 2023 under a malware-as-a-service (MaaS) model, allowing potential customers to leverage YouTube as a primary mechanism – a phenomenon called the YouTube Ghost Network  – to distribute the malicious program by disguising it as cracks for popular software.   Over the past year, the stealer has also been observed being propagated via rogue Blender Foundation files  and a soc...",
      "tags": [
        "vulnerability",
        "malware"
      ],
      "urgency": "Medium",
      "slug": "security-bug-in-stealc-malware-panel-let-researche",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "Black Basta Ransomware Leader Added to EU Most Wanted and INTERPOL Red Notice",
      "link": "https://thehackernews.com/2026/01/black-basta-ransomware-hacker-leader.html",
      "summary": "Ukrainian and German law enforcement authorities have identified  two Ukrainians suspected of working for the Russia-linked ransomware-as-a-service (RaaS) group Black Basta.  In addition, the group's alleged leader, a 35-year-old Russian national named Oleg Evgenievich Nefedov (Нефедов Олег Евгеньевич), has been added  to the European Union's Most Wanted  and INTERPOL's Red Notice  lists, authorities noted.  \"According to the investigation, the suspects specialized in technical hacking of protected systems and were involved in preparing cyberattacks using ransomware,\" the Cyber Police of Ukraine said in a statement.   The agency said the accused individuals functioned as \"hash crackers,\" who specialize in extracting passwords from information systems using specialized software. Once the credential information was obtained, members of the ransomware group broke into corporate networks and ultimately deployed ransomware and extorted money to recover the e...",
      "tags": [
        "ransomware",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "black-basta-ransomware-leader-added-to-eu-most-wan",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "OpenAI to Show Ads in ChatGPT for Logged-In U.S. Adults on Free and Go Plans",
      "link": "https://thehackernews.com/2026/01/openai-to-show-ads-in-chatgpt-for.html",
      "summary": "OpenAI on Friday said it would start showing ads in ChatGPT to logged-in adult U.S. users in both the free and ChatGPT Go tiers in the coming weeks, as the artificial intelligence (AI) company expanded access  to its low-cost subscription globally.  \"You need to know that your data and conversations are protected and never sold to advertisers,\" OpenAI said . \"And we need to keep a high bar and give you control over your experience, so you see truly relevant, high-quality ads—and can turn off personalization if you want.\"   The company has positioned advertising as a way to ensure that the benefits of artificial general intelligence – a term used to describe a stage in machine learning when an AI system can reach or surpass human-level intelligence – can be made more accessible to the masses. In addition, it can be \"transformative\" for small businesses and emerging brands trying to compete, it added.   It also emphasized that ads do not influence responses...",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "openai-to-show-ads-in-chatgpt-for-logged-in-us-adu",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "GootLoader Malware Uses 500–1,000 Concatenated ZIP Archives to Evade Detection",
      "link": "https://thehackernews.com/2026/01/gootloader-malware-uses-5001000.html",
      "summary": "The JavaScript (aka JScript) malware loader called GootLoader  has been observed using a malformed ZIP archive that's designed to sidestep detection efforts by concatenating anywhere from 500 to 1,000 archives.  \"The actor creates a malformed archive as an anti-analysis technique,\" Expel security researcher Aaron Walton said  in a report shared with The Hacker News. \"That is, many unarchiving tools are not able to consistently extract it, but one critical unarchiving tool seems to work consistently and reliably: the default tool built into Windows systems.\"  This leads to a scenario where the archive cannot be processed by tools like WinRAR or 7-Zip, and, therefore, prevents many automated workflows from analyzing the contents of the file. At the same time, it can be opened by the default Windows unarchiver, thereby ensuring that victims who fall victim to the social engineering scheme can extract and run the JavaScript malware.  GootLoader is typically distrib...",
      "tags": [
        "malware",
        "phishing",
        "critical"
      ],
      "urgency": "High",
      "slug": "gootloader-malware-uses-5001000-concatenated-zip-a",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "Five Malicious Chrome Extensions Impersonate Workday and NetSuite to Hijack Accounts",
      "link": "https://thehackernews.com/2026/01/five-malicious-chrome-extensions.html",
      "summary": "Cybersecurity researchers have discovered five new malicious Google Chrome web browser extensions that masquerade as human resources (HR) and enterprise resource planning (ERP) platforms like Workday, NetSuite, and SuccessFactors to take control of victim accounts.  \"The extensions work in concert to steal authentication tokens, block incident response capabilities, and enable complete account takeover through session hijacking,\" Socket security researcher Kush Pandya said  in a Thursday report.  The names of the extensions are listed below -   DataByCloud Access (ID: oldhjammhkghhahhhdcifmmlefibciph, Published by: databycloud1104) - 251 Installs  Tool Access 11 (ID: ijapakghdgckgblfgjobhcfglebbkebf, Published by: databycloud1104) - 101 Installs  DataByCloud 1 (ID: mbjjeombjeklkbndcjgmfcdhfbjngcam, Published by: databycloud1104) - 1,000 Installs  DataByCloud 2 (ID: makdmacamkifdldldlelollkkjnoiedg, Published by: databycloud1104) - 1,000 Installs  Software Access (ID: bmodapc...",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "five-malicious-chrome-extensions-impersonate-workd",
      "source": "The Hacker News",
      "date": "2026-01-19"
    },
    {
      "title": "Tennessee Man Pleads Guilty to Repeatedly Hacking Supreme Court’s Filing System",
      "link": "https://www.securityweek.com/tennessee-man-pleads-guilty-to-repeatedly-hacking-supreme-courts-filing-system/",
      "summary": "Nicholas Moore pleaded guilty to repeatedly hacking the U.S. Supreme Court’s filing system and illegally accessing computer systems belonging to AmeriCorps and the Department of Veterans Affairs.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "tennessee-man-pleads-guilty-to-repeatedly-hacking-",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "In Other News: FortiSIEM Flaw Exploited, Sean Plankey Renominated, Russia’s Polish Grid Attack",
      "link": "https://www.securityweek.com/in-other-news-fortisiem-flaw-exploited-sean-plankey-renominated-russias-polish-grid-attack/",
      "summary": "Other noteworthy stories that might have slipped under the radar: BodySnatcher agentic AI hijacking, Telegram IP exposure, shipping systems hacked by researcher.",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "in-other-news-fortisiem-flaw-exploited-sean-planke",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "Monnai Raises $12 Million for Identity and Risk Data Infrastructure",
      "link": "https://www.securityweek.com/monnai-raises-12-million-for-identity-and-risk-data-infrastructure/",
      "summary": "The company will use the investment to accelerate the adoption of its solution among financial institutions and digital businesses.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "monnai-raises-12-million-for-identity-and-risk-dat",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "Project Eleven Raises $20 Million for Post-Quantum Security",
      "link": "https://www.securityweek.com/project-eleven-raises-20-million-for-post-quantum-security/",
      "summary": "The startup is building the necessary infrastructure and tools to help organizations transition to post-quantum computing.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "project-eleven-raises-20-million-for-post-quantum-",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "750,000 Impacted by Data Breach at Canadian Investment Watchdog",
      "link": "https://www.securityweek.com/750000-impacted-by-data-breach-at-canadian-investment-watchdog/",
      "summary": "The incident impacted the personal information of CIRO member firms and their registered employees.",
      "tags": [
        "breach"
      ],
      "urgency": "Medium",
      "slug": "750000-impacted-by-data-breach-at-canadian-investm",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "Cyber Insights 2026: Social Engineering",
      "link": "https://www.securityweek.com/cyber-insights-2026-social-engineering/",
      "summary": "We’ve known that social engineering would get AI wings. Now, at the beginning of 2026, we are learning just how high those wings can soar.",
      "tags": [
        "phishing"
      ],
      "urgency": "Low",
      "slug": "cyber-insights-2026-social-engineering",
      "source": "SecurityWeek",
      "date": "2026-01-19"
    },
    {
      "title": "OpenAI hostname hints at a new ChatGPT feature codenamed \"Sonata\"",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-hostname-hints-at-a-new-chatgpt-feature-codenamed-sonata/",
      "summary": "OpenAI is reportedly testing a new feature or product codenamed \"Sonata,\" and it could be related to music or audio-related experiences on ChatGPT.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "openai-hostname-hints-at-a-new-chatgpt-feature-cod",
      "source": "BleepingComputer",
      "date": "2026-01-19"
    },
    {
      "title": "New OpenAI leak hints at upcoming ChatGPT features",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/new-openai-leak-hints-at-upcoming-chatgpt-features/",
      "summary": "OpenAI is internally testing a new update for ChatGPT, at least on the web. It'll begin rolling out in the coming weeks.",
      "tags": [
        "breach"
      ],
      "urgency": "Low",
      "slug": "new-openai-leak-hints-at-upcoming-chatgpt-features",
      "source": "BleepingComputer",
      "date": "2026-01-19"
    },
    {
      "title": "New Webinar: Choose Your Own Investigation — Browser Attack Edition",
      "link": "https://pushsecurity.com/webinar/investigating-browser-threats?utm_source=bleeping-computer&utm_medium=sponsored-content&utm_term=ad",
      "summary": "Modern attacks have shifted focus to the browser, yet detection tools remain largely blind to the crucial activity happening there.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-webinar-choose-your-own-investigation-browser-",
      "source": "BleepingComputer",
      "date": "2026-01-19"
    },
    {
      "title": "Microsoft releases OOB Windows updates to fix shutdown, Cloud PC bugs",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-oob-windows-updates-to-fix-shutdown-cloud-pc-bugs/",
      "summary": "Microsoft has released multiple emergency, out-of-band updates for Windows 10, Windows 11, and Windows Server to fix two issues caused by the January Patch Tuesday updates.",
      "tags": [
        "vulnerability"
      ],
      "urgency": "High",
      "slug": "microsoft-releases-oob-windows-updates-to-fix-shut",
      "source": "BleepingComputer",
      "date": "2026-01-19"
    }
  ]
}