{
  "date": "2026-02-24",
  "items": [
    {
      "title": "Anthropic Says Chinese AI Firms Used 16 Million Claude Queries to Copy Model",
      "link": "https://thehackernews.com/2026/02/anthropic-says-chinese-ai-firms-used-16.html",
      "summary": "Anthropic on Monday said it identified \"industrial-scale campaigns\" mounted by three artificial intelligence (AI) companies, DeepSeek, Moonshot AI, and MiniMax, to illegally extract Claude's capabilities to improve their own models.  The distillation attacks generated over 16 million exchanges with its large language model (LLM) through about 24,000 fraudulent accounts in violation of its terms of service and regional access restrictions. All three companies are based in China, where the use of its services is prohibited use of its services is prohibited  due to \"legal, regulatory, and security risks.\"  Distillation refers to a technique where a less capable model is trained on the outputs generated by a stronger AI system. While distillation is a legitimate way for companies to produce smaller, cheaper versions of their own frontier models, it's illegal for competitors to leverage it to acquire such capabilities from other AI companies at a fraction of t...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "anthropic-says-chinese-ai-firms-used-16-million-cl",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "APT28 Targeted European Entities Using Webhook-Based Macro Malware",
      "link": "https://thehackernews.com/2026/02/apt28-targeted-european-entities-using.html",
      "summary": "The Russia-linked state-sponsored threat actor  tracked as APT28  has been attributed to a new campaign targeting specific entities in Western and Central Europe.  The activity, per S2 Grupo's LAB52 threat intelligence team, was active between September 2025 and January 2026. It has been codenamed Operation MacroMaze . \"The campaign relies on basic tooling and the exploitation of legitimate services for infrastructure and data exfiltration,\" the cybersecurity company said .  The attack chains employ spear-phishing emails as a starting point to distribute lure documents that contain a common structural element within their XML, a field named \"INCLUDEPICTURE\" that points to a webhook[.]site URL that hosts a JPG image. This, in turn, causes the image file to be fetched from the remote server when the document is opened.  Put differently, this mechanism acts as a beaconing mechanism akin to a tracking pixel that triggers an outbound HTTP request to the webhook[.]si...",
      "tags": [
        "vulnerability",
        "malware",
        "phishing",
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "apt28-targeted-european-entities-using-webhook-bas",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "Wormable XMRig Campaign Uses BYOVD Exploit and Time-Based Logic Bomb",
      "link": "https://thehackernews.com/2026/02/wormable-xmrig-campaign-uses-byovd.html",
      "summary": "Cybersecurity researchers have disclosed details of a new cryptojacking campaign that uses pirated software bundles as lures to deploy a bespoke XMRig miner program on compromised hosts.  \"Analysis of the recovered dropper, persistence triggers, and mining payload reveals a sophisticated, multi-stage infection prioritizing maximum cryptocurrency mining hashrate, often destabilizing the victim system,\" Trellix researcher Aswath A said  in a technical report published last week.  \"Furthermore, the malware exhibits worm-like capabilities, spreading across external storage devices, enabling lateral movement even in air-gapped environments.\"  The entry point of the attack is the use of social engineering decoys, advertising free premium software in the form of pirated software bundles, such as installers for office productivity suites, to trick unsuspecting users into downloading malware-laced executables.  The binary acts as the central nervous system of the infectio...",
      "tags": [
        "vulnerability",
        "malware",
        "phishing",
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "wormable-xmrig-campaign-uses-byovd-exploit-and-tim",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "⚡ Weekly Recap: Double-Tap Skimmers, PromptSpy AI, 30Tbps DDoS, Docker Malware & More",
      "link": "https://thehackernews.com/2026/02/weekly-recap-double-tap-skimmers.html",
      "summary": "Security news rarely moves in a straight line. This week, it feels more like a series of sharp turns, some happening quietly in the background, others playing out in public view. The details are different, but the pressure points are familiar.  Across devices, cloud services, research labs, and even everyday apps, the line between normal behavior and hidden risk keeps getting thinner. Tools meant to protect, update, or improve systems are also becoming pathways when something goes wrong.  This recap gathers the signals in one place. Quick reads, real impact, and developments that deserve a closer look before they become next week’s bigger problem.  ⚡ Threat of the Week  Dell RecoverPoint for VMs Zero-Day Exploited  — A maximum severity security vulnerability in Dell RecoverPoint for Virtual Machines has been exploited as a zero-day by a suspected China-nexus threat cluster dubbed UNC6201 since mid-2024. The activity involves the exploitation of CVE-2026-22769 (CVSS score: 10.0), a ca...",
      "tags": [
        "vulnerability",
        "malware",
        "critical"
      ],
      "urgency": "High",
      "slug": "-weekly-recap-double-tap-skimmers-promptspy-ai-30t",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "How Exposed Endpoints Increase Risk Across LLM Infrastructure",
      "link": "https://thehackernews.com/2026/02/how-exposed-endpoints-increase-risk.html",
      "summary": "As more organizations run their own Large Language Models (LLMs), they are also deploying more internal services and Application Programming Interfaces (APIs) to support those models. Modern security risks are being introduced less from the models themselves and more from the infrastructure that serves, connects and automates the model. Each new LLM endpoint expands the attack surface, often in ways that are easy to overlook during rapid deployment, especially when endpoints are trusted implicitly. When LLM endpoints accumulate excessive permissions and long-lived credentials are exposed, they can provide far more access than intended. Organizations must prioritize endpoint privilege management because exposed endpoints have become an increasingly common attack vector for cybercriminals to access the systems, identities and secrets that power LLM workloads.  What is an endpoint in modern LLM infrastructure?  In modern LLM infrastructure, an endpoint  is any interface where something —...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "how-exposed-endpoints-increase-risk-across-llm-inf",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "Malicious npm Packages Harvest Crypto Keys, CI Secrets, and API Tokens",
      "link": "https://thehackernews.com/2026/02/malicious-npm-packages-harvest-crypto.html",
      "summary": "Cybersecurity researchers have disclosed what they say is an active \"Shai-Hulud-like\" supply chain worm campaign that has leveraged a cluster of at least 19 malicious npm packages to enable credential harvesting and cryptocurrency key theft.  The campaign has been codenamed SANDWORM_MODE  by supply chain security company Socket. As with prior Shai-Hulud attack waves , the malicious code embedded into the packages comes with capabilities to siphon system information, access tokens, environment secrets, and API keys from developer environments and automatically propagate by abusing stolen npm and GitHub identities to extend its reach.  \"The sample retains Shai-Hulud hallmarks and adds GitHub API exfiltration with DNS fallback, hook-based persistence, SSH propagation fallback, MCP server injection with embedded prompt injection targeting AI coding assistants, and LLM API Key harvesting,\" the company said .   The packages, published to npm by two npm publisher aliases,...",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "malicious-npm-packages-harvest-crypto-keys-ci-secr",
      "source": "The Hacker News",
      "date": "2026-02-24"
    },
    {
      "title": "US Healthcare Diagnostic Firm Says 140,000 Affected by Data Breach",
      "link": "https://www.securityweek.com/us-healthcare-diagnostic-firm-says-140000-affected-by-data-breach/",
      "summary": "The Everest ransomware group has taken credit for a hacker attack on Vikor Scientific, now called Vanta Diagnostics.",
      "tags": [
        "ransomware",
        "breach",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "us-healthcare-diagnostic-firm-says-140000-affected",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Ukrainian Gets 5 Years in US Prison for Aiding North Korean IT Fraud",
      "link": "https://www.securityweek.com/ukrainian-gets-5-years-in-us-prison-for-aiding-north-korean-it-fraud/",
      "summary": "Oleksandr Didenko sold the stolen identities of US citizens, allowing North Koreans to get hired using freelance work platforms.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "ukrainian-gets-5-years-in-us-prison-for-aiding-nor",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Autonomous AI Agents Provide New Class of Supply Chain Attack",
      "link": "https://www.securityweek.com/autonomous-ai-agents-provide-new-class-of-supply-chain-attack/",
      "summary": "While this campaign targets crypto wallets and steals money, the methodology has far wider potential that could be used by other attackers.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "autonomous-ai-agents-provide-new-class-of-supply-c",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Romanian Hacker Pleads Guilty to Selling Access to US State Network",
      "link": "https://www.securityweek.com/romanian-hacker-pleads-guilty-to-selling-access-to-us-state-network/",
      "summary": "Catalin Dragomir admitted in a US court to selling access to an Oregon state government office’s network.",
      "tags": [
        "apt"
      ],
      "urgency": "Low",
      "slug": "romanian-hacker-pleads-guilty-to-selling-access-to",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Hundreds of FortiGate Firewalls Hacked in AI-Powered Attacks: AWS",
      "link": "https://www.securityweek.com/hundreds-of-fortigate-firewalls-hacked-in-ai-powered-attacks-aws/",
      "summary": "Threat actors relying on AI have been exploiting exposed ports and weak credentials to take over FortiGate devices.",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "hundreds-of-fortigate-firewalls-hacked-in-ai-power",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Recent RoundCube Webmail Vulnerability Exploited in Attacks",
      "link": "https://www.securityweek.com/recent-roundcube-webmail-vulnerability-exploited-in-attacks/",
      "summary": "Patched in December 2025, the exploited flaw leads to XSS attacks via the animate tags in SVG documents.",
      "tags": [
        "vulnerability",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "recent-roundcube-webmail-vulnerability-exploited-i",
      "source": "SecurityWeek",
      "date": "2026-02-24"
    },
    {
      "title": "Android mental health apps with 14.7M installs filled with security flaws",
      "link": "https://www.bleepingcomputer.com/news/security/android-mental-health-apps-with-147m-installs-filled-with-security-flaws/",
      "summary": "Several mental health mobile apps with millions of downloads on Google Play contain security vulnerabilities that could expose users' sensitive medical information.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "android-mental-health-apps-with-147m-installs-fill",
      "source": "BleepingComputer",
      "date": "2026-02-24"
    },
    {
      "title": "Spain arrests suspected hacktivists for DDoSing govt sites",
      "link": "https://www.bleepingcomputer.com/news/security/spain-arrests-suspected-anonymous-fenix-hacktivists-for-ddosing-govt-sites/",
      "summary": "Spanish authorities have arrested four alleged members of a hacktivist group believed to have carried out cyberattacks targeting government ministries, political parties, and various public institutions.",
      "tags": [
        "apt",
        "attack"
      ],
      "urgency": "Medium",
      "slug": "spain-arrests-suspected-hacktivists-for-ddosing-go",
      "source": "BleepingComputer",
      "date": "2026-02-24"
    },
    {
      "title": "New Webinar: Defending Against Malicious Browser Extensions",
      "link": "https://pushsecurity.com/webinar/browser-extension-attacks?utm_source=bleepingcomputer&utm_medium=sponsored-content&utm_term=ad",
      "summary": "Attackers are doubling down on malicious browser extensions as their method of choice, stealing data, intercepting cookies and tokens, logging keystrokes, and more.",
      "tags": [
        "attack"
      ],
      "urgency": "Medium",
      "slug": "new-webinar-defending-against-malicious-browser-ex",
      "source": "BleepingComputer",
      "date": "2026-02-24"
    },
    {
      "title": "Microsoft says bug in classic Outlook hides the mouse pointer",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-bug-in-classic-outlook-hides-the-mouse-pointer/",
      "summary": "Microsoft is investigating a known issue that causes the mouse pointer to disappear in the classic Outlook desktop email client for some users.",
      "tags": [
        "cybersecurity"
      ],
      "urgency": "Low",
      "slug": "microsoft-says-bug-in-classic-outlook-hides-the-mo",
      "source": "BleepingComputer",
      "date": "2026-02-24"
    }
  ]
}